## Taps
tap 'FelixKratz/formulae' # JankyBorders
tap 'mobile-dev-inc/tap' # Maestro

cask_args appdir: '/Applications'

######### Binaries #########

# Core
brew 'stow'
brew 'openssl'
brew "gnupg"
brew 'cmake'
# brew 'coreutils'
# brew 'findutils'

## Terminal tools
brew 'fish'
brew 'tmux'
brew 'mise'
brew 'starship'
brew 'bat'
brew 'ack'
brew 'difftastic'
brew 'eza'
brew 'zoxide'
brew 'fd'
brew 'fzf'
brew 'atuin'
brew 'sshs'
brew 'sshpass'
brew 'gh'
brew 'ripgrep'

## Git tools
brew 'git'
brew "git-extras"
brew "git-lfs"
# brew 'lazygit'
# brew 'withgraphite/tap/graphite'

## Mobile dev tools
brew 'gradle'
brew 'watchman'
brew 'cocoapods'
brew 'maven'
brew 'scrcpy'
brew 'expo-orbit'
brew 'fastlane'
brew 'maestro'
# brew 'ios-deploy'

## Dev tools
brew 'supabase/tap/supabase'
brew "dopplerhq/cli/doppler"
brew 'oven-sh/bun/bun'

## Deployment tools
brew 'ctop'
# brew 'kubectl'
# brew 'kops'
# brew 'helm'

## Misc
brew 'mas'
# brew 'blueutil'
brew 'borders'
brew 'btop'
brew 'mole'
brew 'terminal-notifier'

## LLMS / AI
brew 'ollama'
brew 'voiceink'

######### Apps #########

## IDEs
cask 'visual-studio-code'
cask 'cursor'
cask 'zed'
cask 'antigravity'
cask 'android-studio'

## Terminals
# cask 'iterm2'
cask "ghostty"

## Mobile dev tools
cask 'androidtool'
cask "genymotion"
cask 'android-platform-tools'
cask 'ngrok'

##  API Clients
cask "insomnia"
cask 'postman'
cask 'proxyman'
cask 'yaak'

## Containers
cask 'docker-app'
cask 'orbstack'

## Browsers
cask 'thebrowsercompany-dia'
cask 'chrome'
cask 'firefox'

## Communication
cask 'slack'
cask 'discord'
cask 'superhuman'

## Productivity
cask 'notion'
cask 'notion-calendar'
cask 'obsidian'
cask 'linear'
cask 'rescuetime'

## Design & UI
cask 'figma'
cask 'pixelsnap'
cask 'pika'
cask 'imageoptim'
cask 'clop'
cask 'rotato'
cask 'capcut'

## Proton tools
# cask 'protonmail-bridge'
cask 'proton-drive'
cask 'protonvpn'
cask 'proton-mail'

## Elgato tools
cask 'elgato-camera-hub'
cask 'elgato-stream-deck'
cask 'elgato-wave-link'

## Multimedia
cask 'vlc'
# cask 'molotov'
cask 'spotify'
cask 'steam'
cask 'reflex-app'
cask 'soulseek'
cask 'calibre'

## Versionning
# cask 'cakebrew'
# cask 'ndm'
cask 'gitkraken'

## Mac utilities
cask 'coconutbattery'
cask 'aldente'
cask 'istat-menus'
cask 'appcleaner'
cask 'latest'
cask 'bartender'
cask 'raycast'
cask 'nikitabobko/tap/aerospace'
cask 'the-unarchiver'
cask 'cleanshot'
cask 'lookaway'
cask 'flux-app'

## LLMs / AI
cask 'ollama-app'
cask 'claude'
cask 'chatgpt'
cask 'conductor'

## Keyboards & Peripherals
# cask 'logi-options-plus'
cask 'logitech-g-hub'
cask 'via'
cask 'homerow'

## 3D Tooling
cask 'bambu-studio'

## Misc
cask 'macdown'
cask 'carbon-copy-cloner'
cask 'rocket'
cask 'tailscale-app'

## Quicklook
cask 'qlcolorcode'
cask 'qlmarkdown'
cask 'quicklook-json'
cask 'quicklook-csv'
cask "qlvideo"

## Fonts
cask 'font-lato'
cask 'font-hack'
cask 'font-open-sans'
cask 'font-roboto'
cask 'font-fira-code-nerd-font'
cask 'font-jetbrains-mono-nerd-font'

## Mac App Store
mas 'Email - Edison Mail', id: 1489591003
mas 'Yubico Authenticator', id: 1497506650
mas 'Gifsky', id: 1351639930
mas 'Transporter', id: 1450874784
mas 'RocketSim for Xcode Simulator', id: 1504940162
mas 'Infuse', id: 1136220934
mas 'Pure Paste', id: 1611378436
mas 'Brother iPrint$Scan', id: 1193539993
mas 'Todoist', id: 585829637