## Taps
tap 'homebrew/cask'
tap 'homebrew/bundle'
tap 'FelixKratz/formulae' # JankyBorders

cask_args appdir: '/Applications'

######### Binaries #########

# Core
brew 'stow'
brew 'openssl'
brew "gnupg"
brew 'cmake'
# brew 'coreutils'
# brew 'findutils'

## Terminal tools
brew 'fish'
brew 'stow'
brew 'tmux'
brew 'mise'
brew 'starship'
brew 'bat'
brew 'ack'
brew 'difftastic'
brew 'eza'
brew 'zoxide'
brew 'fd'
brew 'atuin'

## Git tools
brew 'git'
brew "git-extras"
brew "git-lfs"
brew 'jesseduffield/lazygit/lazygit'
brew 'withgraphite/tap/graphite'

## Mobile dev tools
brew 'gradle'
brew 'watchman'
brew 'cocoapods'
brew 'maven'
cask 'temurin17'
brew 'scrcpy'
brew 'expo-orbit'
# cask 'android-sdk'
# brew 'ios-deploy'
# brew 'fastlane'

## Deployment tools
brew 'ctop'
# brew 'kubectl'
# brew 'kops'
# brew 'helm'

## Misc
brew 'mas'
brew "dopplerhq/cli/doppler"
brew 'blueutil'
brew 'borders'
brew 'btop'

## Project UQ Learn
brew 'mkcert'
brew 'nss'

######### Apps #########

## IDEs
cask 'visual-studio-code'
cask 'cursor'
cask 'android-studio'

## Terminals
cask 'iterm2'
cask "ghostty"

## Mobile dev tools
cask 'androidtool'
cask "genymotion"

##  API Clients
cask "insomnia"
cask 'postman'
cask 'proxyman'

## Containers
cask 'docker'

## Browsers
cask 'arc'
cask 'firefox'
cask 'google-chrome'

## Communication
cask 'slack'
cask 'discord'

## Productivity
cask 'notion'
cask 'notion-calendar'
cask 'obsidian'
# cask 'microsoft-office'

## Design & UI
cask 'figma'
cask 'pixelsnap'
cask 'pika'
cask 'imageoptim'
cask 'clop'

## Proton tools
cask 'protonmail-bridge'
cask 'proton-drive'
cask 'protonvpn'
cask 'protonmail'

## Elgato tools
cask 'elgato-camera-hub'
cask 'elgato-stream-deck'
cask 'elgato-wave-link'

## Multimedia
cask 'vlc'
cask 'molotov'
cask 'spotify'
cask 'steam'

## Versionning
cask 'cakebrew'
cask 'ndm'
cask 'gitkraken'

## Mac utilities
cask 'coconutbattery'
cask 'aldente'
cask 'istat-menus'
cask 'onyx'
cask 'appcleaner'
cask 'latest'
cask 'bartender'
cask 'raycast'
cask 'nikitabobko/tap/aerospace'
cask 'the-unarchiver'
cask 'cleanshot'
# cask 'cleanmymac'

## LLMs
cask 'ollama'
cask 'superwhisper'

## Misc
cask 'logi-options-plus'
cask 'via'
cask 'calibre'
cask 'macdown'
cask 'carbon-copy-cloner'
cask 'soulseek'
cask 'rocket'
cask 'tailscale'
cask 'transnomino'

## Quicklook
cask 'qlcolorcode'
cask 'qlmarkdown'
cask 'quicklook-json'
cask 'quicklook-csv'
cask "qlvideo"

## Fonts
cask 'font-lato'
cask 'font-hack'
cask 'font-open-sans'
cask 'font-roboto'
cask 'font-fira-code-nerd-font'
cask 'font-jetbrains-mono-nerd-font'

## Mac App Store

mas 'Email - Edison Mail', id: 1489591003
mas 'Yubico Authenticator', id: 1497506650
mas 'Gifsky', id: 1351639930
mas 'Transporter', id: 1450874784
mas 'RocketSim for Xcode Simulator', id: 1504940162
mas 'Infuse', id: 1136220934
# mas 'Moom', id: 419330170
# mas 'Magnet', id: 441258766