## Taps
tap 'homebrew/cask'
tap 'homebrew/cask-versions'
tap 'homebrew/cask-fonts'
tap 'homebrew/cask-drivers'
tap 'homebrew/bundle'
tap 'wix/brew'
tap 'heroku/brew'
tap 'facebook/fb'
tap 'cjbassi/gotop'
tap 'thought-machine/please'

cask_args appdir: '/Applications'

## Binaries
brew 'fish'
brew 'coreutils'
brew 'findutils'
brew 'openssl'
brew 'starship'
brew 'bat'
brew 'git'
brew "git-extras"
brew 'grep'
brew 'mas'
brew 'ack'
brew 'grc'
brew 'gradle'
brew 'watchman'
brew 'cocoapods'
brew 'exa'
brew 'nmap'
brew "htop"
brew "tldr"
brew "dfu-util"
brew "git-lfs"
brew "wix/brew/applesimutils"
brew 'maven'
brew 'heroku'
brew 'kubectl'
brew 'ripgrep'
brew 'cmake'
brew 'pkgconfig'
brew 'fastlane'
brew 'ctop'
brew 'idb-companion'
brew 'gotop'
brew 'kops'
brew 'helm'
brew 'tmux'
cask 'temurin17'
cask 'android-sdk'
brew 'scrcpy'
brew 'please'
brew 'protobuf'
brew 'ruby-build'
brew "gnupg"
brew "dopplerhq/cli/doppler"
brew 'ios-deploy'
brew 'difftastic'

## Dev
cask 'ndm'
cask 'postman'
cask 'sequel-pro'
cask 'visual-studio-code'
cask 'iterm2'
cask 'gitkraken'
cask 'android-studio'
cask 'androidtool'
cask 'docker'
cask "flipper"
cask "insomnia"
cask "genymotion"

## Browsers
cask 'arc'
cask 'firefox'
cask 'google-chrome'
cask 'brave-browser'
cask 'opera'

## Business
cask 'slack'
cask 'discord'
cask 'fantastical'
cask 'dropbox'
cask 'notion'
cask 'figma'
cask 'protonmail-bridge'
cask 'proton-drive'

## Multimedia
cask 'vlc'
cask 'molotov'
cask 'spotify'
cask 'steam'

## Utilities
cask 'appcleaner'
cask 'calibre'
cask 'sip'
cask 'bartender'
cask 'via'
cask 'alfred'
cask 'pixelsnap'
cask 'the-unarchiver'
cask 'onyx'
cask 'beardedspice'
cask 'imageoptim'
cask 'macdown'
cask 'microsoft-office'
cask 'cakebrew'
cask 'carbon-copy-cloner'
cask 'istat-menus'
cask 'cleanmymac'
cask 'pika'
cask 'elgato-camera-hub'
cask 'elgato-stream-deck'
cask 'elgato-wave-link'
cask 'logi-options-plus'
cask 'protonvpn'
cask 'aldente'
cask 'cleanshot'
cask 'coconutbattery'

# Downloads
cask 'sabnzbd'
cask 'radarr'
cask 'sonarr'
cask 'soulseek'

## Quicklook
cask 'qlcolorcode'
cask 'qlmarkdown'
cask 'quicklook-json'
cask 'quicklook-csv'
cask 'qlstephen'
cask "qlvideo"
cask "quicklookase"

## Fonts
cask 'font-lato'
cask 'font-hack'
cask 'font-open-sans'
cask 'font-roboto'
cask 'font-fira-code-nerd-font'
cask 'font-jetbrains-mono-nerd-font'

## Mac App Store
mas 'Magnet', id: 441258766
mas 'Email - Edison Mail', id: 1489591003
mas 'Yubico Authenticator', id: 1497506650
mas 'Moom', id: 419330170
mas 'Gifsky', id: 1351639930
mas 'Mactracker', id: 430255202
mas 'Transporter', id: 1450874784
mas 'Endel: Focus, Sleep, Relax', id: 1346247457
mas 'RocketSim for Xcode Simulator', id: 1504940162
mas 'Ledger Live: Crypto & NFT App', id: 1361671700
